docs/02_2D_Coordinates.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-01 Sat 00:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Coordinates &amp; Transforms in 2D</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Chris Hodapp" />
<link rel="stylesheet" href="css/tutorial.css"/>
<link rel="stylesheet" href="css/code.css"/>
<link rel='import' href='juicy-ace-editor.html'/>
</head>
<body>
<div id="content">
<h1 class="title">Coordinates &amp; Transforms in 2D</h1>

<div id="outline-container-orgf62b315" class="outline-2">
<h2 id="orgf62b315"><span class="section-number-2"> 2</span> Coordinates &amp; Transforms in 2D</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org51b3404" class="outline-3">
<h3 id="org51b3404"><span class="section-number-3"> 2.1</span> A slightly boring, laborious example</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The Introduction mentioned that all the code this tutorial deals with
is <i>fragment shaders</i> (or pixel shaders) in GLSL.  For our sake, what
that means is that we are dealing with short programs which create
images (and eventually animations) by explicitly giving the color of
every pixel in the image.
</p>

<p>
This may be a bit different than what you are used to in more general
programming languages.  You are likely used to programs for which, at
any given point in time, variables have a specific value and the
program is executing some specific part of the code.
</p>

<p>
Fragment shaders deviate from this a bit, and require a bit of a
different mindset.  The way we use them here, they can be thought of
as programs which run simultaneously over every pixel in the image,
and likewise, have variables which take on different values for every
pixel.  (See <a target='_blank' href="https://en.wikipedia.org/wiki/Stream_processing">Stream processing</a> for a little more in-depth information
on this.)
</p>

<p>
The below code gives a very simple example of this:
</p>

<div class="org-src-container">
<juicy-ace-editor id='webgl-juicy-ace-editor-1' mode="ace/mode/glsl" readonly="true">uniform vec2 resolution;

void main()
{
  vec2 uv = gl_FragCoord.xy / resolution.xy;
  gl_FragColor = vec4(uv.x, uv.y, 0.0, 1.0);
}
</juicy-ace-editor><div id='webgl-full-code-1' style='display:none'>uniform vec2 resolution;

void main()
{
  vec2 uv = gl_FragCoord.xy / resolution.xy;
  gl_FragColor = vec4(uv.x, uv.y, 0.0, 1.0);
}
</div><div class='no-print' align="left"><button type="button" onclick="copy_code($('#webgl-full-code-1').text());">Use code &raquo;</button></div>
</div>

<p>
Click "Use code", and then go to the "Render" tab.  You should see a
gradient - green at the top left corner, yellow at the top right, red
at the bottom right, black at the bottom left, and colors blended
everywhere between those.
</p>

<p>
The code might look familiar if you've used something like C, C++, or
Java, but with a few unfamiliar constructs.  <code>vec2</code> and <code>vec4</code> are
vector types containing 2 elements and 4 elements, respectively (more
on that later).  For now, just treat a <code>vec2</code> as a structure with
fields <code>x</code> and <code>y</code>, and a <code>vec4</code> as a structure with fields <code>r</code>, <code>g</code>,
<code>b</code>, and <code>a</code>, all of them floating-point values.
</p>

<p>
<code>gl_FragCoord</code> is one of those variables which takes on a different
value for every pixel in the image; the <code>.xy</code> provides us a <code>vec2</code> of
just the X and Y coordinates of each pixel.  <code>resolution</code>, on the
other hand, is a <i>uniform</i> variable - it has the same value over all
pixels.  In this case, it's something the environment provides to tell
us the total number of pixels along X and Y.
</p>

<p>
<code>gl_FragCoord.xy / resolution.xy</code> produces a new <code>vec2</code> by dividing
<code>gl_FragCoord.x</code> by <code>resolution.x</code> and <code>gl_FragCoord.y</code> by
<code>resolution.y</code>.  Try the code below if you want to verify yourself
that it's the same as splitting them out:
</p>

<div class="org-src-container">
<juicy-ace-editor id='webgl-juicy-ace-editor-2' mode="ace/mode/glsl" readonly="true">uniform vec2 resolution;

void main()
{
  float u = gl_FragCoord.x / resolution.x;
  float v = gl_FragCoord.y / resolution.y;
  gl_FragColor = vec4(u, v, 0.0, 1.0);
}
</juicy-ace-editor><div id='webgl-full-code-2' style='display:none'>uniform vec2 resolution;

void main()
{
  float u = gl_FragCoord.x / resolution.x;
  float v = gl_FragCoord.y / resolution.y;
  gl_FragColor = vec4(u, v, 0.0, 1.0);
}
</div><div class='no-print' align="left"><button type="button" onclick="copy_code($('#webgl-full-code-2').text());">Use code &raquo;</button></div>
</div>

<p>
Thus, the <code>uv</code> vector (or <code>u</code> and <code>v</code> separately above) contains X and
Y coordinates that each have been <i>normalized</i> range from 0 to 1.
Since it's dividing by the total resolution, it works identically at
any resolution (resize the render window and see, or click the
lower-right icon to make it full-screen).  This gives us a normal
<i>(x,y)</i> coordinate plane (or Cartesian plane) where the lower-left
point is (0,0), moving to the right increases the X coordinate, and
moving up increases the Y coordinate - up to the top-right corner
which is (1,1).  This is a fairly standard transformation to see
anytime pixel locations are involved.
</p>

<p>
Finally, <code>gl_FragColor</code> is where we assign the pixel's respective
color into a <code>vec4</code> by giving, in order, its red, green, blue, and
alpha channel values (and we ignore alpha here, as it refers to
transparency and doesn't make sense to use here).  Each value is from
0 to 1, and values outside that range are clipped inside of it; try
messing with the values (e.g. replacing <code>u</code> with <code>u * 4.0</code>) to verify
this.
</p>

<p>
The result, then, is that we've assigned the red channel of each pixel
to its X coordinate, and the green channel to the Y coordinate.  The
blue channel was just left at 0.  Thus, at the very lower-left, we'd
expect to see black (red and green are both 0 because X and Y are
zero), and moving up to the top-right, we'd expect to see yellow (red
and green are both at their maximum of 1).
</p>
</div>
</div>
