example/02_2D_Coordinates.org
** What can this actually do?

You may be complaining that a colored gradient is a rather
uninteresting thing to draw, and it is.  However, with some additional
math, this method of creating graphics is remarkably flexible.

First off, though, we must be able to create some basic shapes and
constructs to demonstrate things.  We've already shown how the
computation of =uv= above can create simple color gradients - but
color gradients by their inherent fuzziness make it difficult to show
any sort of sharp details or well-defined shapes.

So, consider the below code.  The =uv.x= line isn't especially
important, but it will appear again and again, and it is there to
correct the [[https://en.wikipedia.org/wiki/Aspect_ratio_%2528image%2529][aspect ratio]] of the image.  In our case, all it means is
that =uv.x= will be scaled so that a given step in =uv.x= is the same
distance as in =uv.y=, and our shapes aren't squashed.

#+BEGIN_SRC glsl
uniform vec2 resolution;
float count = 10.0;

void main()
{
    vec2 uv = gl_FragCoord.xy/resolution.xy;
    // Correct aspect:
    uv.x = uv.x * resolution.x / resolution.y;

    vec2 uv_mod = mod(uv * grid, 1.0);
    
    gl_FragColor = vec4(uv_mod.x, uv_mod.y, 0, 1.0);
}
#+END_SRC

The important line is the definition of =uv_mod=: we've scaled up =uv=
by a certain amount in both X and Y, and then used [[https://en.wikipedia.org/wiki/Modulo_operation][modulo]] to turn it
to a repeating pattern again in X and Y - across some distance, it
rises from 0 to 1, and then goes back to 0.

You should be able to see a sort of grid pattern emerging, and playing
with the value of =count=, or changing the =1.0= in =mod(..., 1.0)= to
something else, should produce some effects that make sense.  However,
if you look, you'll see it's still just a bunch of smaller gradients.
Try looking just at =uv_mod.x= or just =uv_mod.y= (i.e. change
=gl_FragColor= so that the red, green, and blue channel are all
=uv_mod.x=, and then so they all are =uv_mod.y=).

Now consider: How could we turn this into a grid with sharp lines,
instead of gradients?  Try to make sense of the below, and change
values like =thickness= to something else:

#+BEGIN_SRC glsl
uniform vec2 resolution;
float count = 10.0;
float thickness = 0.05;

void main()
{
    vec2 uv = gl_FragCoord.xy/resolution.xy;
    // Correct aspect:
    uv.x = uv.x * resolution.x / resolution.y;

    vec2 uv_mod = mod(uv * count, 1.0);
    float x1 = uv_mod.x < thickness ? 1.0 : 0.0;
    float y1 = uv_mod.y < thickness ? 1.0 : 0.0;
    
    gl_FragColor = vec4(x1, y1, 0, 1.0);
}
#+END_SRC

This is a fairly small change from the previous code.  If you're not
familiar, =uv_mod= is now defined using the [[https://en.wikipedia.org/wiki/%253F:#C][ternary operator]] that is
commonly used in C.  In simple, it has forced the darker parts (see
=thickness=) to be uniformly light, and the parts other than that to
be uniformly black.  However, the X and Y grid lines are still
separated out, and we may simply add them together to give white grid
lines:

#+BEGIN_SRC glsl
uniform vec2 resolution;
float count = 10.0;
float thickness = 0.05;

void main()
{
    vec2 uv = gl_FragCoord.xy/resolution.xy;
    // Correct aspect:
    uv.x = uv.x * resolution.x / resolution.y;

    vec2 uv_mod = mod(uv * count, 1.0);
    float x1 = uv_mod.x < thickness ? 1.0 : 0.0;
    float y1 = uv_mod.y < thickness ? 1.0 : 0.0;
    float grey = x1 + y1;
    
    gl_FragColor = vec4(grey, grey, grey, 1.0);
}
#+END_SRC

