docs/02_2D_Coordinates.html

<div id="outline-container-org915cfc5" class="outline-3">
<h3 id="org915cfc5"><span class="section-number-3"> 2.2</span> What can this actually do?</h3>
<div class="outline-text-3" id="text-1-2">
<p>
You may be complaining that a colored gradient is a rather
uninteresting thing to draw, and it is.  However, with some additional
math, this method of creating graphics is remarkably flexible.
</p>

<p>
First off, though, we must be able to create some basic shapes and
constructs to demonstrate things.  We've already shown how the
computation of <code>uv</code> above can create simple color gradients - but
color gradients by their inherent fuzziness make it difficult to show
any sort of sharp details or well-defined shapes.
</p>

<p>
So, consider the below code.  The <code>uv.x</code> line isn't especially
important, but it will appear again and again, and it is there to
correct the <a target='_blank' href="https://en.wikipedia.org/wiki/Aspect_ratio_%28image%29">aspect ratio</a> of the image.  In our case, all it means is
that <code>uv.x</code> will be scaled so that a given step in <code>uv.x</code> is the same
distance as in <code>uv.y</code>, and our shapes aren't squashed.
</p>

<div class="org-src-container">
<juicy-ace-editor id='webgl-juicy-ace-editor-3' mode="ace/mode/glsl" readonly="true">uniform vec2 resolution;
float count = 10.0;

void main()
{
    vec2 uv = gl_FragCoord.xy/resolution.xy;
    // Correct aspect:
    uv.x = uv.x * resolution.x / resolution.y;

    vec2 uv_mod = mod(uv * grid, 1.0);
    
    gl_FragColor = vec4(uv_mod.x, uv_mod.y, 0, 1.0);
}
</juicy-ace-editor><div id='webgl-full-code-3' style='display:none'>uniform vec2 resolution;
float count = 10.0;

void main()
{
    vec2 uv = gl_FragCoord.xy/resolution.xy;
    // Correct aspect:
    uv.x = uv.x * resolution.x / resolution.y;

    vec2 uv_mod = mod(uv * grid, 1.0);
    
    gl_FragColor = vec4(uv_mod.x, uv_mod.y, 0, 1.0);
}
</div><div class='no-print' align="left"><button type="button" onclick="copy_code($('#webgl-full-code-3').text());">Use code &raquo;</button></div>
</div>

<p>
The important line is the definition of <code>uv_mod</code>: we've scaled up <code>uv</code>
by a certain amount in both X and Y, and then used <a target='_blank' href="https://en.wikipedia.org/wiki/Modulo_operation">modulo</a> to turn it
to a repeating pattern again in X and Y - across some distance, it
rises from 0 to 1, and then goes back to 0.
</p>

<p>
You should be able to see a sort of grid pattern emerging, and playing
with the value of <code>count</code>, or changing the <code>1.0</code> in <code>mod(..., 1.0)</code> to
something else, should produce some effects that make sense.  However,
if you look, you'll see it's still just a bunch of smaller gradients.
Try looking just at <code>uv_mod.x</code> or just <code>uv_mod.y</code> (i.e. change
<code>gl_FragColor</code> so that the red, green, and blue channel are all
<code>uv_mod.x</code>, and then so they all are <code>uv_mod.y</code>).
</p>

<p>
Now consider: How could we turn this into a grid with sharp lines,
instead of gradients?  Try to make sense of the below, and change
values like <code>thickness</code> to something else:
</p>

<div class="org-src-container">
<juicy-ace-editor id='webgl-juicy-ace-editor-4' mode="ace/mode/glsl" readonly="true">uniform vec2 resolution;
float count = 10.0;
float thickness = 0.05;

void main()
{
    vec2 uv = gl_FragCoord.xy/resolution.xy;
    // Correct aspect:
    uv.x = uv.x * resolution.x / resolution.y;

    vec2 uv_mod = mod(uv * count, 1.0);
    float x1 = uv_mod.x &lt; thickness ? 1.0 : 0.0;
    float y1 = uv_mod.y &lt; thickness ? 1.0 : 0.0;
    
    gl_FragColor = vec4(x1, y1, 0, 1.0);
}
</juicy-ace-editor><div id='webgl-full-code-4' style='display:none'>uniform vec2 resolution;
float count = 10.0;
float thickness = 0.05;

void main()
{
    vec2 uv = gl_FragCoord.xy/resolution.xy;
    // Correct aspect:
    uv.x = uv.x * resolution.x / resolution.y;

    vec2 uv_mod = mod(uv * count, 1.0);
    float x1 = uv_mod.x &lt; thickness ? 1.0 : 0.0;
    float y1 = uv_mod.y &lt; thickness ? 1.0 : 0.0;
    
    gl_FragColor = vec4(x1, y1, 0, 1.0);
}
</div><div class='no-print' align="left"><button type="button" onclick="copy_code($('#webgl-full-code-4').text());">Use code &raquo;</button></div>
</div>

<p>
This is a fairly small change from the previous code.  If you're not
familiar, <code>uv_mod</code> is now defined using the <a target='_blank' href="https://en.wikipedia.org/wiki/%3F:#C">ternary operator</a> that is
commonly used in C.  In simple, it has forced the darker parts (see
<code>thickness</code>) to be uniformly light, and the parts other than that to
be uniformly black.  However, the X and Y grid lines are still
separated out, and we may simply add them together to give white grid
lines:
</p>

<div class="org-src-container">
<juicy-ace-editor id='webgl-juicy-ace-editor-5' mode="ace/mode/glsl" readonly="true">uniform vec2 resolution;
float count = 10.0;
float thickness = 0.05;

void main()
{
    vec2 uv = gl_FragCoord.xy/resolution.xy;
    // Correct aspect:
    uv.x = uv.x * resolution.x / resolution.y;

    vec2 uv_mod = mod(uv * count, 1.0);
    float x1 = uv_mod.x &lt; thickness ? 1.0 : 0.0;
    float y1 = uv_mod.y &lt; thickness ? 1.0 : 0.0;
    float grey = x1 + y1;
    
    gl_FragColor = vec4(grey, grey, grey, 1.0);
}
</juicy-ace-editor><div id='webgl-full-code-5' style='display:none'>uniform vec2 resolution;
float count = 10.0;
float thickness = 0.05;

void main()
{
    vec2 uv = gl_FragCoord.xy/resolution.xy;
    // Correct aspect:
    uv.x = uv.x * resolution.x / resolution.y;

    vec2 uv_mod = mod(uv * count, 1.0);
    float x1 = uv_mod.x &lt; thickness ? 1.0 : 0.0;
    float y1 = uv_mod.y &lt; thickness ? 1.0 : 0.0;
    float grey = x1 + y1;
    
    gl_FragColor = vec4(grey, grey, grey, 1.0);
}
</div><div class='no-print' align="left"><button type="button" onclick="copy_code($('#webgl-full-code-5').text());">Use code &raquo;</button></div>
</div>
</div>
</div>
