example/02_2D_Coordinates.org
** Implicit functions

Perhaps it wasn't obvious why this is significant, but to try to
explain it further: We just used an [[https://en.wikipedia.org/wiki/Implicit_function][implicit function]] to draw lines.
Rather than drawing lines by iteratively walking along pixel
coordinates and darkening certain ones according to a line's formula,
we started with a formula that was something like:

\begin{equation}
   f(x,y)=I(x\mod C)+I(y\mod C) \mathrm{ where}\\
   I(a) = \begin{cases}
   a < \epsilon & : 1\\
   a \ge \epsilon & : 0
   \end{cases}
\end{equation}

and then evaluated this over every pixel, using $C$ as basically
=count= and $\epsilon$ as =thickness=.  We've taken some liberties, in
that we're comparing with $\epsilon$ rather than 0, but that is due to
using floating point and a discrete number of pixels. If we express
this function explicitly:

#+BEGIN_SRC glsl
uniform vec2 resolution;

float grid(vec2 xy, float thickness, float count)
{
    vec2 uv_mod = mod(xy * count, 1.0);
    float x1 = uv_mod.x < thickness ? 1.0 : 0.0;
    float y1 = uv_mod.y < thickness ? 1.0 : 0.0;
    return x1 + y1;
}

void main()
{
    vec2 uv = gl_FragCoord.xy/resolution.xy;
    // Correct aspect:
    uv.x = uv.x * resolution.x / resolution.y;

    float grey = grid(uv, 0.05, 10.0);
    
    gl_FragColor = vec4(grey, grey, grey, 1.0);
}
#+END_SRC

Put another way, we just drew [[https://en.wikipedia.org/wiki/Contour_line][isolines]] of that function.

More about this implicit functions will follow later.  For now, we
just use it to create a grid to help illustrate some transformations.
Below is one that may be familiar: It converts the coordinates we're
using already - rectangular, or Cartesian, coordinates in =uv= - to
[[https://en.wikipedia.org/wiki/Polar_coordinate_system][polar coordinates]].  =uv= is also rescaled and moved so that the center
is (0,0).  Then, we use polar rather than rectangular coordinates to
draw this grid.

#+BEGIN_SRC glsl
uniform vec2 resolution;
const float PI = 3.14159265359;

float grid(vec2 xy, float thickness, float count)
{
    vec2 uv_mod = mod(xy * count, 1.0);
    float x1 = uv_mod.x < thickness ? 1.0 : 0.0;
    float y1 = uv_mod.y < thickness ? 1.0 : 0.0;
    return x1 + y1;
}

vec2 rect2polar(vec2 xy)
{
    vec2 polar = vec2(length(xy), atan(xy.y, xy.x));
    return polar;
}

void main()
{
    vec2 uv = 2.0 * gl_FragCoord.xy/resolution.xy - 1.0;
    // Correct aspect:
    uv.x = uv.x * resolution.x / resolution.y;

    vec2 polar = rect2polar(uv);
    polar.y = polar.y / PI;
    float grey = grid(polar, 0.05, 10.0);
    
    gl_FragColor = vec4(grey, grey, grey, 1.0);
}
#+END_SRC

Note that, despite the notation, fields =x= and =y= of =polar= now
stand for radius and angle, not X and Y coordinates.

We started with a grid made of equally-sized squares.  The above
should give some intuitive sense of how the conversion to polar
coordinates transformed space: The grid "squares" are now
differently-sized sections of a circle. 

** Animation & Mouse Input

Up to this point, we've just been rendering images that don't change
over time or in response to any input (aside from you editing the
code).  The below code makes a couple modifications to the last
example to change this:

#+BEGIN_SRC glsl
uniform vec2 resolution;
const float PI = 3.14159265359;
uniform vec4 mouse;
uniform float time;

float grid(vec2 xy, float thickness, float count)
{
    vec2 uv_mod = mod(xy * count, 1.0);
    float x1 = uv_mod.x < thickness ? 1.0 : 0.0;
    float y1 = uv_mod.y < thickness ? 1.0 : 0.0;
    return x1 + y1;
}

vec2 rect2polar(vec2 xy)
{
    vec2 polar = vec2(sqrt(xy.x * xy.x + xy.y * xy.y), atan(xy.y, xy.x));
    return polar;
}

void main()
{
    vec2 uv = gl_FragCoord.xy/resolution.xy;
    // Correct aspect:
    uv.x = uv.x * resolution.x / resolution.y;

    // Normalize mouse position:
    vec2 m = vec2(mouse.x/resolution.x, 1.0 - mouse.y/resolution.y);
    m.x = m.x * resolution.x / resolution.y;

    vec2 polar = rect2polar(uv - m);
    // Radius:
    polar.x = polar.x - time / 10.0;
    // Angle:
    polar.y = (polar.y / PI) + time / 8.0;
    float grey = grid(polar, 0.05, 10.0);
    
    gl_FragColor = vec4(grey, grey, grey, 1.0);
}
#+END_SRC

To see the render react to input, click or drag in the render window.
The environment provides two new variables - =mouse= and =time= -
which give, respectively, the mouse location and a time value (which
simply counts up in seconds).  (=mouse=, for whatever reason, uses a
different coordinate system than the rest of the image, so above we
remedy this when we compute =m= and then we do the same transformation
to normalize this mouse position as we do each pixel coordinate.)

There are two buttons at the bottom center of the render window which
let you stop animation completely, and pause or resume it.  It will
continue to react to mouse input even when paused or stopped.

In the last example, the center of the image was (0,0) (in both
rectangular and polar coordinates, incidentally); in this one, note
that by subtracting the mouse position, wherever you click is the new
origin.

See the changes to =polar.x= and =polar.y= for the source of the
animation; change how =time= is used (adding vs. subtracting, and
dividing by larger and smaller numbers), and it should make sense how
this works.

** Control Inputs

# I think I need this interactivity before I can proceed

** Textures?

# Goal: To quickly get into color functions that are more interesting
# and better for illustrating the nonlinear warps.  From here, I can
# get into weird spiral things, and eventually into Perlin noise /
# simplex noise.

# Tying things together: This is useful in its own right (link to
# Conal's blog and anything else I know of), but also is useful as a
# way to apply textures to objects in conjunction with more
# complicated shading (link to Perlin's paper, An image synthesizer).
# Mention this notion of treating textures like a 3D liquid that the
# object is dipped in, versus something 2D that is mapped to an
# object - though, that is done too (link to UV texturing).

