docs/02_2D_Coordinates.html

<div id="outline-container-org519132f" class="outline-3">
<h3 id="org519132f"><span class="section-number-3"> 2.3</span> Implicit functions</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Perhaps it wasn't obvious why this is significant, but to try to
explain it further: We just used an <a target='_blank' href="https://en.wikipedia.org/wiki/Implicit_function">implicit function</a> to draw lines.
Rather than drawing lines by iteratively walking along pixel
coordinates and darkening certain ones according to a line's formula,
we started with a formula that was something like:
</p>

\begin{equation}
   f(x,y)=I(x\mod C)+I(y\mod C) \mathrm{ where}\\
   I(a) = \begin{cases}
   a < \epsilon & : 1\\
   a \ge \epsilon & : 0
   \end{cases}
\end{equation}

<p>
and then evaluated this over every pixel, using \(C\) as basically
<code>count</code> and \(\epsilon\) as <code>thickness</code>.  We've taken some liberties, in
that we're comparing with \(\epsilon\) rather than 0, but that is due to
using floating point and a discrete number of pixels. If we express
this function explicitly:
</p>

<div class="org-src-container">
<juicy-ace-editor id='webgl-juicy-ace-editor-6' mode="ace/mode/glsl" readonly="true">uniform vec2 resolution;

float grid(vec2 xy, float thickness, float count)
{
    vec2 uv_mod = mod(xy * count, 1.0);
    float x1 = uv_mod.x &lt; thickness ? 1.0 : 0.0;
    float y1 = uv_mod.y &lt; thickness ? 1.0 : 0.0;
    return x1 + y1;
}

void main()
{
    vec2 uv = gl_FragCoord.xy/resolution.xy;
    // Correct aspect:
    uv.x = uv.x * resolution.x / resolution.y;

    float grey = grid(uv, 0.05, 10.0);
    
    gl_FragColor = vec4(grey, grey, grey, 1.0);
}
</juicy-ace-editor><div id='webgl-full-code-6' style='display:none'>uniform vec2 resolution;

float grid(vec2 xy, float thickness, float count)
{
    vec2 uv_mod = mod(xy * count, 1.0);
    float x1 = uv_mod.x &lt; thickness ? 1.0 : 0.0;
    float y1 = uv_mod.y &lt; thickness ? 1.0 : 0.0;
    return x1 + y1;
}

void main()
{
    vec2 uv = gl_FragCoord.xy/resolution.xy;
    // Correct aspect:
    uv.x = uv.x * resolution.x / resolution.y;

    float grey = grid(uv, 0.05, 10.0);
    
    gl_FragColor = vec4(grey, grey, grey, 1.0);
}
</div><div class='no-print' align="left"><button type="button" onclick="copy_code($('#webgl-full-code-6').text());">Use code &raquo;</button></div>
</div>

<p>
Put another way, we just drew <a target='_blank' href="https://en.wikipedia.org/wiki/Contour_line">isolines</a> of that function.
</p>

<p>
More about this implicit functions will follow later.  For now, we
just use it to create a grid to help illustrate some transformations.
Below is one that may be familiar: It converts the coordinates we're
using already - rectangular, or Cartesian, coordinates in <code>uv</code> - to
<a target='_blank' href="https://en.wikipedia.org/wiki/Polar_coordinate_system">polar coordinates</a>.  <code>uv</code> is also rescaled and moved so that the center
is (0,0).  Then, we use polar rather than rectangular coordinates to
draw this grid.
</p>

<div class="org-src-container">
<juicy-ace-editor id='webgl-juicy-ace-editor-7' mode="ace/mode/glsl" readonly="true">uniform vec2 resolution;
const float PI = 3.14159265359;

float grid(vec2 xy, float thickness, float count)
{
    vec2 uv_mod = mod(xy * count, 1.0);
    float x1 = uv_mod.x &lt; thickness ? 1.0 : 0.0;
    float y1 = uv_mod.y &lt; thickness ? 1.0 : 0.0;
    return x1 + y1;
}

vec2 rect2polar(vec2 xy)
{
    vec2 polar = vec2(length(xy), atan(xy.y, xy.x));
    return polar;
}

void main()
{
    vec2 uv = 2.0 * gl_FragCoord.xy/resolution.xy - 1.0;
    // Correct aspect:
    uv.x = uv.x * resolution.x / resolution.y;

    vec2 polar = rect2polar(uv);
    polar.y = polar.y / PI;
    float grey = grid(polar, 0.05, 10.0);
    
    gl_FragColor = vec4(grey, grey, grey, 1.0);
}
</juicy-ace-editor><div id='webgl-full-code-7' style='display:none'>uniform vec2 resolution;
const float PI = 3.14159265359;

float grid(vec2 xy, float thickness, float count)
{
    vec2 uv_mod = mod(xy * count, 1.0);
    float x1 = uv_mod.x &lt; thickness ? 1.0 : 0.0;
    float y1 = uv_mod.y &lt; thickness ? 1.0 : 0.0;
    return x1 + y1;
}

vec2 rect2polar(vec2 xy)
{
    vec2 polar = vec2(length(xy), atan(xy.y, xy.x));
    return polar;
}

void main()
{
    vec2 uv = 2.0 * gl_FragCoord.xy/resolution.xy - 1.0;
    // Correct aspect:
    uv.x = uv.x * resolution.x / resolution.y;

    vec2 polar = rect2polar(uv);
    polar.y = polar.y / PI;
    float grey = grid(polar, 0.05, 10.0);
    
    gl_FragColor = vec4(grey, grey, grey, 1.0);
}
</div><div class='no-print' align="left"><button type="button" onclick="copy_code($('#webgl-full-code-7').text());">Use code &raquo;</button></div>
</div>

<p>
Note that, despite the notation, fields <code>x</code> and <code>y</code> of <code>polar</code> now
stand for radius and angle, not X and Y coordinates.
</p>

<p>
We started with a grid made of equally-sized squares.  The above
should give some intuitive sense of how the conversion to polar
coordinates transformed space: The grid "squares" are now
differently-sized sections of a circle. 
</p>
</div>
</div>

<div id="outline-container-org7bff0d6" class="outline-3">
<h3 id="org7bff0d6"><span class="section-number-3"> 2.4</span> Animation &amp; Mouse Input</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Up to this point, we've just been rendering images that don't change
over time or in response to any input (aside from you editing the
code).  The below code makes a couple modifications to the last
example to change this:
</p>

<div class="org-src-container">
<juicy-ace-editor id='webgl-juicy-ace-editor-8' mode="ace/mode/glsl" readonly="true">uniform vec2 resolution;
const float PI = 3.14159265359;
uniform vec4 mouse;
uniform float time;

float grid(vec2 xy, float thickness, float count)
{
    vec2 uv_mod = mod(xy * count, 1.0);
    float x1 = uv_mod.x &lt; thickness ? 1.0 : 0.0;
    float y1 = uv_mod.y &lt; thickness ? 1.0 : 0.0;
    return x1 + y1;
}

vec2 rect2polar(vec2 xy)
{
    vec2 polar = vec2(sqrt(xy.x * xy.x + xy.y * xy.y), atan(xy.y, xy.x));
    return polar;
}

void main()
{
    vec2 uv = gl_FragCoord.xy/resolution.xy;
    // Correct aspect:
    uv.x = uv.x * resolution.x / resolution.y;

    // Normalize mouse position:
    vec2 m = vec2(mouse.x/resolution.x, 1.0 - mouse.y/resolution.y);
    m.x = m.x * resolution.x / resolution.y;

    vec2 polar = rect2polar(uv - m);
    // Radius:
    polar.x = polar.x - time / 10.0;
    // Angle:
    polar.y = (polar.y / PI) + time / 8.0;
    float grey = grid(polar, 0.05, 10.0);
    
    gl_FragColor = vec4(grey, grey, grey, 1.0);
}
</juicy-ace-editor><div id='webgl-full-code-8' style='display:none'>uniform vec2 resolution;
const float PI = 3.14159265359;
uniform vec4 mouse;
uniform float time;

float grid(vec2 xy, float thickness, float count)
{
    vec2 uv_mod = mod(xy * count, 1.0);
    float x1 = uv_mod.x &lt; thickness ? 1.0 : 0.0;
    float y1 = uv_mod.y &lt; thickness ? 1.0 : 0.0;
    return x1 + y1;
}

vec2 rect2polar(vec2 xy)
{
    vec2 polar = vec2(sqrt(xy.x * xy.x + xy.y * xy.y), atan(xy.y, xy.x));
    return polar;
}

void main()
{
    vec2 uv = gl_FragCoord.xy/resolution.xy;
    // Correct aspect:
    uv.x = uv.x * resolution.x / resolution.y;

    // Normalize mouse position:
    vec2 m = vec2(mouse.x/resolution.x, 1.0 - mouse.y/resolution.y);
    m.x = m.x * resolution.x / resolution.y;

    vec2 polar = rect2polar(uv - m);
    // Radius:
    polar.x = polar.x - time / 10.0;
    // Angle:
    polar.y = (polar.y / PI) + time / 8.0;
    float grey = grid(polar, 0.05, 10.0);
    
    gl_FragColor = vec4(grey, grey, grey, 1.0);
}
</div><div class='no-print' align="left"><button type="button" onclick="copy_code($('#webgl-full-code-8').text());">Use code &raquo;</button></div>
</div>

<p>
To see the render react to input, click or drag in the render window.
The environment provides two new variables - <code>mouse</code> and <code>time</code> -
which give, respectively, the mouse location and a time value (which
simply counts up in seconds).  (<code>mouse</code>, for whatever reason, uses a
different coordinate system than the rest of the image, so above we
remedy this when we compute <code>m</code> and then we do the same transformation
to normalize this mouse position as we do each pixel coordinate.)
</p>

<p>
There are two buttons at the bottom center of the render window which
let you stop animation completely, and pause or resume it.  It will
continue to react to mouse input even when paused or stopped.
</p>

<p>
In the last example, the center of the image was (0,0) (in both
rectangular and polar coordinates, incidentally); in this one, note
that by subtracting the mouse position, wherever you click is the new
origin.
</p>

<p>
See the changes to <code>polar.x</code> and <code>polar.y</code> for the source of the
animation; change how <code>time</code> is used (adding vs. subtracting, and
dividing by larger and smaller numbers), and it should make sense how
this works.
</p>
</div>
</div>
