example/02_2D_Coordinates.org
** Transformations

We've used various kinds of transformation on the image so far, but
they haven't really been explained or made explicit.

*** Scaling

*** Translation

*** Rotation

*** Shearing

*** Vectors & Matrices
# Homogeneous coordinates?
# Composition
# Inverses

# Does it even make sense to explain these here, or wait until 3D?  I
# feel like it's just drudgery to go into too much detail explaining
# them here - but it may also be too much too fast to wait until 3D to
# try to explain them.
#
# However, I have no particular reason to explain them *before* the texturing stuff.

# Part of the point is to show that WebGL has built-in support for
# some of these matters, I suppose.

# Misc:
# WebGL 'mix' function - get softer edges on lines?

