docs/02_2D_Coordinates.html

<div id="outline-container-orgac04710" class="outline-3">
<h3 id="orgac04710"><span class="section-number-3"> 2.5</span> Control Inputs</h3>
<div class="outline-text-3" id="text-1-5">
</div>
</div>

<div id="outline-container-org71f3174" class="outline-3">
<h3 id="org71f3174"><span class="section-number-3"> 2.6</span> Textures?</h3>
<div class="outline-text-3" id="text-1-6">
</div>
</div>

<div id="outline-container-orgc74ff2b" class="outline-3">
<h3 id="orgc74ff2b"><span class="section-number-3"> 2.7</span> Transformations</h3>
<div class="outline-text-3" id="text-1-7">
<p>
We've used various kinds of transformation on the image so far, but
they haven't really been explained or made explicit.
</p>
</div>

<div id="outline-container-org7d09630" class="outline-4">
<h4 id="org7d09630"><span class="section-number-4"> 2.7.1</span> Scaling</h4>
</div>

<div id="outline-container-org8f29c42" class="outline-4">
<h4 id="org8f29c42"><span class="section-number-4"> 2.7.2</span> Translation</h4>
</div>

<div id="outline-container-orgd6d725f" class="outline-4">
<h4 id="orgd6d725f"><span class="section-number-4"> 2.7.3</span> Rotation</h4>
</div>

<div id="outline-container-orgcca7cd8" class="outline-4">
<h4 id="orgcca7cd8"><span class="section-number-4"> 2.7.4</span> Shearing</h4>
</div>

<div id="outline-container-org9ab3aca" class="outline-4">
<h4 id="org9ab3aca"><span class="section-number-4"> 2.7.5</span> Vectors &amp; Matrices</h4>
<div class="outline-text-4" id="text-1-7-5">
</div>
</div>
</div>
</div>
</div>
</body>
</html>
